tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "mongodb/brew"
tap "wvanlint/twf"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Core application library for C
brew "glib"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Vector graphics library with cross-device output support
brew "cairo"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Modern replacement for 'ls'
brew "exa"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Command-line fuzzy finder written in Go
brew "fzf"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# OpenType text shaping engine
brew "harfbuzz"
# Network authentication protocol
brew "krb5"
# Simple terminal UI for git commands
brew "lazygit"
# Asynchronous event library
brew "libevent"
# Portable Foreign Function Interface library
brew "libffi"
# Access large language models from the command-line
brew "llm"
# Rainbows and unicorns in your console!
brew "lolcat"
# Platform built on V8 to build network applications
brew "node"
# MongoDB Shell to connect, configure, query, and work with your MongoDB database
brew "mongosh"
# Cross platform, open source .NET development framework
brew "mono"
# Interactive cheatsheet tool for the command-line
brew "navi"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Platform built on V8 to build network applications
brew "node@14"
# Platform built on V8 to build network applications
brew "node@16"
# Manage multiple Node.js versions
brew "nvm"
# Framework for layout and rendering of i18n text
brew "pango"
# Python dependency management tool
brew "pipenv"
# Object-relational database system
brew "postgresql@14"
# Python version management
brew "pyenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Command-line deletion tool focused on safety, ergonomics, and performance
brew "rm-improved"
# Advanced proxy caching server for HTTP, HTTPS, FTP, and Gopher
brew "squid"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Manage complex tmux sessions easily
brew "tmuxinator"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Tool for creating isolated virtual python environments
brew "virtualenv"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
# Standalone tree view file explorer, inspired by fzf
brew "wvanlint/twf/twf", args: ["HEAD"]
# Enable Windows-like alt-tab
cask "alt-tab"
cask "font-hack-nerd-font"
# Utility to hide menu bar items
cask "hiddenbar"
# Menu bar calendar
cask "itsycal"
