tap "common-fate/granted"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "mongodb/brew"
tap "warrensbox/tap"
tap "wvanlint/twf"
brew "act"
brew "openssl@3"
brew "asdf"
brew "pycparser"
brew "cffi"
brew "cryptography"
brew "aws-sam-cli"
brew "awscli"
brew "bat"
brew "glib"
brew "lima"
brew "colima"
brew "colordiff"
brew "python@3.12"
brew "credstash"
brew "direnv"
brew "docker"
brew "docker-credential-helper"
brew "docutils"
brew "exa"
brew "fzf"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "gnupg"
brew "harlequin"
brew "jq"
brew "kubernetes-cli"
brew "kubectx"
brew "lazysql"
brew "libffi"
brew "llm"
brew "node"
brew "mongosh"
brew "mono"
brew "mysql"
brew "navi"
brew "neovim"
brew "python@3.10"
brew "node@14"
brew "node@16"
brew "nvm"
brew "pango"
brew "pipenv", link: false
brew "postgresql@14", restart_service: :changed
brew "pyenv"
brew "python@3.11"
brew "python@3.9"
brew "qemu"
brew "redis", restart_service: :changed
brew "ripgrep"
brew "rm-improved"
brew "telnet"
brew "tldr", link: false
brew "tlrc"
brew "tmux"
brew "tmuxinator"
brew "tree"
brew "urlview"
brew "yq"
brew "common-fate/granted/granted"
brew "jesseduffield/lazygit/lazygit"
brew "mongodb/brew/mongodb-community"
brew "warrensbox/tap/tfswitch"
brew "wvanlint/twf/twf", args: ["HEAD"]
cask "alacritty"
cask "alt-tab"
cask "db-browser-for-sqlite"
cask "dockdoor"
cask "font-0xproto-nerd-font"
cask "font-3270-nerd-font"
cask "font-agave-nerd-font"
cask "font-anonymice-nerd-font"
cask "font-arimo-nerd-font"
cask "font-aurulent-sans-mono-nerd-font"
cask "font-bigblue-terminal-nerd-font"
cask "font-bitstream-vera-sans-mono-nerd-font"
cask "font-blex-mono-nerd-font"
cask "font-caskaydia-cove-nerd-font"
cask "font-caskaydia-mono-nerd-font"
cask "font-code-new-roman-nerd-font"
cask "font-comic-shanns-mono-nerd-font"
cask "font-commit-mono-nerd-font"
cask "font-cousine-nerd-font"
cask "font-d2coding-nerd-font"
cask "font-daddy-time-mono-nerd-font"
cask "font-dejavu-sans-mono-nerd-font"
cask "font-droid-sans-mono-nerd-font"
cask "font-envy-code-r-nerd-font"
cask "font-fantasque-sans-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-geist-mono-nerd-font"
cask "font-go-mono-nerd-font"
cask "font-gohufont-nerd-font"
cask "font-hack-nerd-font"
cask "font-hasklug-nerd-font"
cask "font-heavy-data-nerd-font"
cask "font-hurmit-nerd-font"
cask "font-im-writing-nerd-font"
cask "font-inconsolata-go-nerd-font"
cask "font-inconsolata-lgc-nerd-font"
cask "font-inconsolata-nerd-font"
cask "font-intone-mono-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-iosevka-term-nerd-font"
cask "font-iosevka-term-slab-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-lekton-nerd-font"
cask "font-liberation-nerd-font"
cask "font-lilex-nerd-font"
cask "font-m+-nerd-font"
cask "font-martian-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-monaspace-nerd-font"
cask "font-monocraft-nerd-font"
cask "font-monofur-nerd-font"
cask "font-monoid-nerd-font"
cask "font-mononoki-nerd-font"
cask "font-noto-nerd-font"
cask "font-open-dyslexic-nerd-font"
cask "font-overpass-nerd-font"
cask "font-profont-nerd-font"
cask "font-proggy-clean-tt-nerd-font"
cask "font-recursive-mono-nerd-font"
cask "font-roboto-mono-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "font-shure-tech-mono-nerd-font"
cask "font-space-mono-nerd-font"
cask "font-symbols-only-nerd-font"
cask "font-terminess-ttf-nerd-font"
cask "font-tinos-nerd-font"
cask "font-ubuntu-mono-nerd-font"
cask "font-ubuntu-nerd-font"
cask "font-ubuntu-sans-nerd-font"
cask "font-victor-mono-nerd-font"
cask "font-zed-mono-nerd-font"
cask "hiddenbar"
cask "itsycal" 