tap "homebrew/bundle"
tap "homebrew/services"
tap "mongodb/brew"
tap "wvanlint/twf"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Core application library for C
brew "glib"
# Vector graphics library with cross-device output support
brew "cairo"
# Modern replacement for 'ls'
brew "exa"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Command-line fuzzy finder written in Go
brew "fzf"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# OpenType text shaping engine
brew "harfbuzz"
# Network authentication protocol
brew "krb5"
# Simple terminal UI for git commands
brew "lazygit"
# Asynchronous event library
brew "libevent"
# Portable Foreign Function Interface library
brew "libffi"
# Access large language models from the command-line
brew "llm"
# Platform built on V8 to build network applications
brew "node"
# MongoDB Shell to connect, configure, query, and work with your MongoDB database
brew "mongosh"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Cross platform, open source .NET development framework
brew "mono"
# Interactive cheatsheet tool for the command-line
brew "navi"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node@14"
# Platform built on V8 to build network applications
brew "node@16"
# Manage multiple Node.js versions
brew "nvm"
# Framework for layout and rendering of i18n text
brew "pango"
# Python dependency management tool
brew "pipenv"
# Object-relational database system
brew "postgresql@14", restart_service: true
# Python version management
brew "pyenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Command-line deletion tool focused on safety, ergonomics, and performance
brew "rm-improved"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Manage complex tmux sessions easily
brew "tmuxinator"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Tool for creating isolated virtual python environments
brew "virtualenv"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
# Enable Windows-like alt-tab
cask "alt-tab"
# Utility to hide menu bar items
cask "hiddenbar"
# Menu bar calendar
cask "itsycal"
vscode "aaron-bond.better-comments"
vscode "adpyke.codesnap"
vscode "alefragnani.bookmarks"
vscode "anseki.vscode-color"
vscode "aykutsarac.jsoncrack-vscode"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "equimper.react-native-react-redux"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "grapecity.gc-excelviewer"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "gruntfuggly.todo-tree"
vscode "jorgeserrano.vscode-csharp-snippets"
vscode "kleber-swf.unity-code-snippets"
vscode "kreativ-software.csharpextensions"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-dotnettools.vscodeintellicode-csharp"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.makefile-tools"
vscode "msjsdiag.vscode-react-native"
vscode "oderwat.indent-rainbow"
vscode "phplasma.csv-to-table"
vscode "pkief.material-icon-theme"
vscode "pranaygp.vscode-css-peek"
vscode "prisma.prisma"
vscode "ptd.vscode-unitymeta"
vscode "quicktype.quicktype"
vscode "rangav.vscode-thunder-client"
vscode "shardulm94.trailing-spaces"
vscode "streetsidesoftware.code-spell-checker"
vscode "styled-components.vscode-styled-components"
vscode "tobiah.unity-tools"
vscode "tomoki1207.pdf"
vscode "usernamehw.errorlens"
vscode "vincaslt.highlight-matching-tag"
vscode "visualstudiotoolsforunity.vstuc"
vscode "wayou.vscode-todo-highlight"
vscode "wix.glean"
vscode "wix.vscode-import-cost"
vscode "xabikos.javascriptsnippets"
vscode "xabikos.reactsnippets"
vscode "yclepticstudios.unity-snippets"
