tap "common-fate/granted"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "mongodb/brew"
tap "warrensbox/tap"
tap "wvanlint/twf"
brew "act"
brew "openssl@3"
brew "asdf"
brew "pycparser"
brew "cffi"
brew "cryptography"
brew "aws-sam-cli"
brew "awscli"
brew "bat"
brew "glib"
brew "colordiff"
brew "python@3.12"
brew "credstash"
brew "direnv"
brew "docutils"
brew "exa"
brew "fzf"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "gnupg"
brew "harlequin"
brew "jq"
brew "lazysql"
brew "libffi"
brew "llm"
brew "node"
brew "mongosh"
brew "mono"
brew "mysql"
brew "navi"
brew "neovim"
brew "nvm"
brew "pango"
brew "pipenv", link: false
brew "postgresql@14", restart_service: :changed
brew "pyenv"
brew "qemu"
brew "ripgrep"
brew "rm-improved"
brew "telnet"
brew "tldr", link: false
brew "tlrc"
brew "tmux"
brew "tmuxinator"
brew "tree"
brew "urlview"
brew "yq"
brew "common-fate/granted/granted"
brew "jesseduffield/lazygit/lazygit"
brew "mongodb/brew/mongodb-community"
brew "warrensbox/tap/tfswitch"
brew "wvanlint/twf/twf", args: ["HEAD"]
cask "alacritty"
cask "alt-tab"
cask "db-browser-for-sqlite"
cask "dockdoor"
cask "font-hack-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "hiddenbar"
cask "itsycal" 